; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob85) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate5)
	(at pallet6 depot2)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate4)
	(at pallet8 distributor0)
	(clear pallet8)
	(at pallet9 depot1)
	(clear crate3)
	(at pallet10 distributor0)
	(clear pallet10)
	(at pallet11 depot2)
	(clear pallet11)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 381)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 344)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 depot1)
	(available hoist11)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 28)
	(at crate1 depot0)
	(on crate1 crate0)
	(= (weight crate1) 55)
	(at crate2 depot0)
	(on crate2 crate1)
	(= (weight crate2) 70)
	(at crate3 depot1)
	(on crate3 pallet9)
	(= (weight crate3) 51)
	(at crate4 distributor2)
	(on crate4 pallet7)
	(= (weight crate4) 47)
	(at crate5 distributor2)
	(on crate5 pallet5)
	(= (weight crate5) 61)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet10)
		(on crate1 crate0)
		(on crate2 pallet6)
		(on crate3 pallet1)
		(on crate4 pallet7)
		(on crate5 pallet9)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist7 crate2 crate1 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist7) (on crate2 crate1)
   added: (lifting hoist7 crate2) (clear crate1)
   changed: (fuel-cost) from 0 to 1
   goals met: 2 of 6
2. (load hoist7 crate2 truck1 depot0)
   deleted: (lifting hoist7 crate2)
   added: (in crate2 truck1) (available hoist7)
   changed: (current_load truck1) from 0 to 70
   goals met: 2 of 6
3. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 1 to 11
   goals met: 2 of 6
4. (lift hoist5 crate5 pallet5 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 pallet5)
   added: (lifting hoist5 crate5) (clear pallet5)
   changed: (fuel-cost) from 11 to 12
   goals met: 2 of 6
5. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 12 to 22
   goals met: 2 of 6
6. (load hoist5 crate5 truck0 distributor2)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck0) (available hoist5)
   changed: (current_load truck0) from 0 to 61
   goals met: 2 of 6
7. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 22 to 32
   goals met: 2 of 6
8. (unload hoist2 crate2 truck1 depot2)
   deleted: (in crate2 truck1) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck1) from 70 to 0
   goals met: 2 of 6
9. (lift hoist1 crate3 pallet9 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 pallet9)
   added: (lifting hoist1 crate3) (clear pallet9)
   changed: (fuel-cost) from 32 to 33
   goals met: 2 of 6
10. (unload hoist11 crate5 truck0 depot1)
   deleted: (in crate5 truck0) (available hoist11)
   added: (lifting hoist11 crate5)
   changed: (current_load truck0) from 61 to 0
   goals met: 2 of 6
11. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 33 to 43
   goals met: 2 of 6
12. (drop hoist2 crate2 pallet6 depot2)
   deleted: (lifting hoist2 crate2) (clear pallet6)
   added: (available hoist2) (at crate2 depot2) (clear crate2) (on crate2 pallet6)
   goals met: 3 of 6
13. (drop hoist1 crate3 pallet1 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 pallet1)
   goals met: 4 of 6
14. (drop hoist11 crate5 pallet9 depot1)
   deleted: (lifting hoist11 crate5) (clear pallet9)
   added: (available hoist11) (at crate5 depot1) (clear crate5) (on crate5 pallet9)
   goals met: 5 of 6
15. (lift hoist0 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate0)
   added: (lifting hoist0 crate1) (clear crate0)
   changed: (fuel-cost) from 43 to 44
   goals met: 4 of 6
16. (lift hoist7 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist7) (on crate0 pallet0)
   added: (lifting hoist7 crate0) (clear pallet0)
   changed: (fuel-cost) from 44 to 45
   goals met: 4 of 6
17. (load hoist7 crate0 truck0 depot0)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck0) (available hoist7)
   changed: (current_load truck0) from 0 to 28
   goals met: 4 of 6
18. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 28 to 83
   goals met: 4 of 6
19. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 45 to 55
   goals met: 4 of 6
20. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   changed: (current_load truck0) from 83 to 55
   goals met: 4 of 6
21. (drop hoist3 crate0 pallet10 distributor0)
   deleted: (lifting hoist3 crate0) (clear pallet10)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 pallet10)
   goals met: 5 of 6
22. (unload hoist3 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   changed: (current_load truck0) from 55 to 0
   goals met: 5 of 6
23. (drop hoist3 crate1 crate0 distributor0)
   deleted: (lifting hoist3 crate1) (clear crate0)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 crate0)
   goals met: 6 of 6
